ahmed-sobhy-coder/embedded-systems-tiva/share00/MCAL/tm4c123io.c
void GPIO_INDEX_Output(uint8_t port, uint8_t bits, uint8_t volt) {
	switch (port) {
	case PORTA:
		switch (bits) {
		case PA2:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOA->DATA, PA2);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOA->DATA, PA2);
			}
			break;
		case PA3:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOA->DATA, PA3);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOA->DATA, PA3);
			}
			break;
		case PA4:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOA->DATA, PA4);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOA->DATA, PA4);
			}
			break;
		case PA5:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOA->DATA, PA5);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOA->DATA, PA5);
			}
			break;
		case PA6:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOA->DATA, PA6);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOA->DATA, PA6);
			}
			break;
		case PA7:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOA->DATA, PA7);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOA->DATA, PA7);
				break;
			}
			break;
		}
		break;
	case PORTB:
		switch (bits) {
		case PB0:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOB->DATA, PB0);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOB->DATA, PB0);
				break;
			}
			break;
		case PB1:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOB->DATA, PB1);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOB->DATA, PB1);
				break;
			}
			break;
		case PB2:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOB->DATA, PB2);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOB->DATA, PB2);
				break;
			}
			break;
		case PB3:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOB->DATA, PB3);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOB->DATA, PB3);
				break;
			}
			break;
		case PB4:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOB->DATA, PB4);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOB->DATA, PB4);
				break;
			}
			break;
		case PB5:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOB->DATA, PB5);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOB->DATA, PB5);
				break;
			}
			break;
		case PB6:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOB->DATA, PB6);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOB->DATA, PB6);
				break;
			}
			break;
		case PB7:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOB->DATA, PB7);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOB->DATA, PB7);
				break;
			}
			break;
		}
		break;
	case PORTC:
		switch (bits) {
		case PC4:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOC->DATA, PC4);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOC->DATA, PC4);
				break;
			}
			break;
		case PC5:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOC->DATA, PC5);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOC->DATA, PC5);
				break;
			}
			break;
		case PC6:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOC->DATA, PC6);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOC->DATA, PC6);
				break;
			}
			break;
		case PC7:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOC->DATA, PC7);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOC->DATA, PC7);
				break;
			}
			break;
		}
		break;
	case PORTD:
		switch (bits) {
		case PD0:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOD->DATA, PD0);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOD->DATA, PD0);
				break;
			}
			break;
		case PD1:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOD->DATA, PD1);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOD->DATA, PD1);
				break;
			}
			break;
		case PD2:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOD->DATA, PD2);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOD->DATA, PD2);
				break;
			}
			break;
		case PD3:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOD->DATA, PD3);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOD->DATA, PD3);
				break;
			}
			break;
		case PD6:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOD->DATA, PD6);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOD->DATA, PD6);
				break;
			}
			break;
		case PD7:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOD->DATA, PD7);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOD->DATA, PD7);
				break;
			}
			break;
		}
		break;
	case PORTE:
		switch (bits) {
		case PE0:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOE->DATA, PE0);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOE->DATA, PE0);
				break;
			}
			break;
		case PE1:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOE->DATA, PE1);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOE->DATA, PE1);
				break;
			}
			break;
		case PE2:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOE->DATA, PE2);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOE->DATA, PE2);
				break;
			}
			break;
		case PE3:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOE->DATA, PE3);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOE->DATA, PE3);
				break;
			}
			break;
		case PE4:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOE->DATA, PE4);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOE->DATA, PE4);
				break;
			}
			break;
		case PE5:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOE->DATA, PE5);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOE->DATA, PE5);
				break;
			}
			break;
		}
		break;
	case PORTF:
		switch (bits) {
		case PF0:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOF->DATA, PF0);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOF->DATA, PF0);
				break;
			}
			break;
		case PF1:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOF->DATA, PF1);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOF->DATA, PF1);
				break;
			}
			break;
		case PF2:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOF->DATA, PF2);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOF->DATA, PF2);
				break;
			}
			break;
		case PF3:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOF->DATA, PF3);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOF->DATA, PF3);
				break;
			}
			break;
		case PF4:
			switch (volt) {
			case DIGITAL_HIGH:
				ST1B(GPIOF->DATA, PF4);
				break;
			case DIGITAL_LOW:
				CLR1B(GPIOF->DATA, PF4);
				break;
			}
			break;
		}
	}
}
uint8_t GPIO_INDEX_Read_Input(uint8_t port, uint8_t bits) {
	uint8_t input=0;
	switch (port) {
	case PORTA:
		switch (bits) {
		case PA2:
				input=RD1B(GPIOA->DATA, PA2);
				break;
		case PA3:
				input=RD1B(GPIOA->DATA, PA3);
			break;
		case PA4:
				input=RD1B(GPIOA->DATA, PA4);
				break;
		case PA5:
				input=RD1B(GPIOA->DATA, PA5);
				break;
		case PA6:
				input=RD1B(GPIOA->DATA, PA6);
				break;
		case PA7:
				input=RD1B(GPIOA->DATA, PA7);
				break;
			}
			break;
	case PORTB:
		switch (bits) {
		case PB0:
				input=RD1B(GPIOB->DATA, PB0);
				break;
		case PB1:
				input=RD1B(GPIOB->DATA, PB1);
			break;
		case PB2:
				input=RD1B(GPIOB->DATA, PB2);
			break;
		case PB3:
				input=RD1B(GPIOB->DATA, PB3);
			break;
		case PB4:
				input=RD1B(GPIOB->DATA, PB4);
				break;
		case PB5:
				input=RD1B(GPIOB->DATA, PB5);
			break;
		case PB6:
				input=RD1B(GPIOB->DATA, PB6);
			break;
		case PB7:
				input=RD1B(GPIOB->DATA, PB7);
				break;
		}
		break;
	case PORTC:
		switch (bits) {
			case PC4:
				input=RD1B(GPIOC->DATA, PC4);
				break;
		case PC5:
				input=RD1B(GPIOC->DATA, PC5);
			break;
		case PC6:
				input=RD1B(GPIOC->DATA, PC6);
			break;
		case PC7:
				input=RD1B(GPIOC->DATA, PC7);
				break;
		}
		break;
	case PORTD:
		switch (bits) {
		case PD0:
				input=RD1B(GPIOD->DATA, PD0);
				break;
		case PD1:
				input=RD1B(GPIOD->DATA, PD1);
				break;
		case PD2:
				input=RD1B(GPIOD->DATA, PD2);
			break;
		case PD3:
				input=RD1B(GPIOD->DATA, PD3);
			break;
		case PD6:
				input=RD1B(GPIOD->DATA, PD6);
			break;
		case PD7:
				input=RD1B(GPIOD->DATA, PD7);
			break;
		}
		break;
	case PORTE:
		switch (bits) {
		case PE0:
				input=RD1B(GPIOE->DATA, PE0);
				break;
		case PE1:
				input=RD1B(GPIOE->DATA, PE1);
				break;
		case PE2:
				input=RD1B(GPIOE->DATA, PE2);
				break;
		case PE3:
				input=RD1B(GPIOE->DATA, PE3);
			break;
		case PE4:
				input=RD1B(GPIOE->DATA, PE4);
			break;
		case PE5:
				input=RD1B(GPIOE->DATA, PE5);
			break;
		}
		break;
	case PORTF:
		switch (bits) {
		case PF0:
				input=RD1B(GPIOF->DATA, PF0);
		case PF1:
				input=RD1B(GPIOF->DATA, PF1);
				break;
		case PF2:
				input=RD1B(GPIOF->DATA, PF2);
			break;
		case PF3:
				input=RD1B(GPIOF->DATA, PF3);
			break;
		case PF4:
				input=RD1B(GPIOF->DATA, PF4);
				break;
			}
			break;
	}
	return input;
}


