ahmed-sobhy-coder/embedded-systems-tiva/share00/MCAL/tm4c123io.c
void GPIO_Port_Init(uint8_t port, uint8_t direction) {
	switch (port) {
	case PORTA:
		if (RD1B(SYSCTL->RCGCGPIO, PORTA) == 0) {
			ST1B(SYSCTL->RCGCGPIO, PORTA);
			while (RD1B(SYSCTL->PRGPIO, PORTA) == 0) {
			};
		}
		STV6BI(GPIOA->AMSEL, PA2, 0);
		STV6BI(GPIOA->AFSEL, PA2, 0);
		STV6BI(GPIOA->DEN, PA2, 0x3F);
		switch (direction) {
		case DIGITAL_OUTPUT:
			STV6BI(GPIOA->DIR, PA2, 0x3F);
			break;
		case DIGITAL_INPUT_INERNAL_PULLUP:
			STV6BI(GPIOA->DEN, PA2, 0);

		}
		break;
	case PORTB:
		if (RD1B(SYSCTL->RCGCGPIO, PORTB) == 0) {
			ST1B(SYSCTL->RCGCGPIO, PORTB);
			while (RD1B(SYSCTL->PRGPIO, PORTB) == 0) {
			};
		}
		STV(GPIOB->AMSEL, 0);
		STV(GPIOB->AFSEL, 0);
		STV(GPIOB->DEN, 0xFF);
		switch (direction) {
		case DIGITAL_OUTPUT:
			STV(GPIOB->DIR, 0xFF);
			break;
		case DIGITAL_INPUT_INERNAL_PULLUP:
			STV(GPIOB->DIR, 0);

		}
		break;
	case PORTC:
		if (RD1B(SYSCTL->RCGCGPIO, PORTC) == 0) {
			ST1B(SYSCTL->RCGCGPIO, PORTC);
			while (RD1B(SYSCTL->PRGPIO, PORTC) == 0) {
			};
		}
		STV4BI(GPIOC->AMSEL, PC4, 0);
		STV4BI(GPIOC->AFSEL, PC4, 0);
		STV4BI(GPIOC->DEN, PC4, 0x0F);
		switch (direction) {
		case DIGITAL_OUTPUT:
			STV4BI(GPIOC->DIR, PC4, 0x0F);
			break;
		case DIGITAL_INPUT_INERNAL_PULLUP:
			STV4BI(GPIOC->DIR, PC4, 0);
		}
		break;
	case PORTD:
		if (RD1B(SYSCTL->RCGCGPIO, PORTD) == 0) {
			ST1B(SYSCTL->RCGCGPIO, PORTD);
			while (RD1B(SYSCTL->PRGPIO, PORTD) == 0) {
			};
		}
		STV4BI(GPIOD->AMSEL, PD0, 0);
		STV2BI(GPIOD->AMSEL, PD6, 0);
		STV4BI(GPIOD->AFSEL, PD0, 0);
		STV2BI(GPIOD->AFSEL, PD6, 0);
		STV4BI(GPIOD->DEN, PD0, 0x0F);
		STV2BI(GPIOD->DEN, PD6, 0x3);
		STV(GPIOD->LOCK, UNLOCK);
		ST1B(GPIOD->CR, PD7);
		switch (direction) {
		case DIGITAL_OUTPUT:
			STV4BI(GPIOD->DIR, PD0, 0x0F);
			STV2BI(GPIOD->DIR, PD6, 0x3);
			break;
		case DIGITAL_INPUT_INERNAL_PULLUP:
			STV4BI(GPIOD->DIR, PD0, 0);
			STV2BI(GPIOD->DIR, PD6, 0);
		}
		break;
	case PORTE:
		if (RD1B(SYSCTL->RCGCGPIO, PORTE) == 0) {
			ST1B(SYSCTL->RCGCGPIO, PORTE);
			while (RD1B(SYSCTL->PRGPIO, PORTE) == 0) {
			};
		}
			STV6BI(GPIOE->AMSEL, PE0, 0);
			STV6BI(GPIOE->AFSEL, PE0, 0);
      STV6BI(GPIOE->DEN, PE0, 0x3F);
		switch (direction) {
		case DIGITAL_OUTPUT:
			STV6BI(GPIOE->DIR, PE0, 0x3F);
			break;
		case DIGITAL_INPUT_INERNAL_PULLUP:
			STV6BI(GPIOE->DIR, PE0, 0);
		}
		break;
	case PORTF:
		if (RD1B(SYSCTL->RCGCGPIO, PORTF) == 0) {
			ST1B(SYSCTL->RCGCGPIO, PORTF);
			while (RD1B(SYSCTL->PRGPIO, PORTF) == 0) {
			};
		}
		STV(GPIOF->LOCK, UNLOCK);
		ST1B(GPIOF->CR, PF0);
		STV4BI(GPIOF->AMSEL, PF0, 0);
		STV4BI(GPIOF->AFSEL, PF0, 0);
		STV4BI(GPIOF->DEN, PF0, 0x0F);
		switch (direction) {
		case DIGITAL_OUTPUT:
			STV4BI(GPIOF->DIR, PF0, 0x0F);
			break;
		case DIGITAL_INPUT_INERNAL_PULLUP:
			STV4BI(GPIOF->DIR, PF0, 0);

		}
	}
}
void GPIO_Port_Output(uint8_t port, uint8_t volt) {
	switch (port) {
	case PORTA:
		switch (volt) {
		case DIGITAL_HIGH:
			STV6BI(GPIOA->DATA, PA2, volt);

			break;
		case DIGITAL_LOW:
			STV6BI(GPIOA->DATA, PA2, volt);

		}
		break;
	case PORTB:
		switch (volt) {
		case DIGITAL_HIGH:
			STV(GPIOB->DATA, volt);

			break;
		case DIGITAL_LOW:
			STV(GPIOB->DATA, volt);

		}
		break;
	case PORTC:
		switch (volt) {
		case DIGITAL_HIGH:
			STV4BI(GPIOC->DATA, PC4, volt);

			break;
		case DIGITAL_LOW:
			STV4BI(GPIOC->DATA, PC4, volt);

			break;
		}
		break;
	case PORTD:
		switch (volt) {
		case DIGITAL_HIGH:
			STV4BI(GPIOD->DATA, PD0, volt);
			STV2BI(GPIOD->DATA, PD6, volt);
			break;
		case DIGITAL_LOW:
			STV4BI(GPIOD->DATA, PD0, volt);
			STV2BI(GPIOD->DATA, PD6, volt);
			break;
		}
		break;
	case PORTE:
		switch (volt) {
		case DIGITAL_HIGH:
			STV6BI(GPIOE->DATA, PE0, volt);
			break;
		case DIGITAL_LOW:
			STV6BI(GPIOE->DATA, PE0, 0);
		}
		break;
	case PORTF:
		switch (volt) {
		case DIGITAL_HIGH:
			STV4BI(GPIOF->DATA, PF0, 0x0F);
			break;
		case DIGITAL_LOW:
			STV4BI(GPIOF->DATA, PF0, 0);

		}
		break;
	}
}
void GPIO_Two_INDEXs_Output(uint8_t port, uint8_t start_INDEX,uint8_t value) {
	switch (port) {
	case PORTA:
			STV2BI(GPIOA->DATA, start_INDEX, value);
		break;
	case PORTB:
			STV2BI(GPIOB->DATA, start_INDEX, value);
		break;
	case PORTC:
			STV2BI(GPIOC->DATA, start_INDEX, value);
		break;
	case PORTD:
			STV2BI(GPIOD->DATA, start_INDEX, value);
		break;
	case PORTE:
			STV2BI(GPIOE->DATA, start_INDEX, value);
		break;
	case PORTF:
			STV2BI(GPIOF->DATA, start_INDEX, value);
		break;
	}
}
void GPIO_Three_INDEXs_Digital_Output(uint8_t port, uint8_t start_INDEX,uint8_t value) {
	switch (port) {
	case PORTA:
			STV3BI(GPIOA->DATA, start_INDEX, value);
		break;
	case PORTB:
			STV3BI(GPIOB->DATA, start_INDEX, value);
		break;
	case PORTC:
			STV3BI(GPIOC->DATA, start_INDEX, value);
		break;
	case PORTD:
			STV3BI(GPIOD->DATA, start_INDEX, value);
		break;
	case PORTE:
			STV3BI(GPIOE->DATA, start_INDEX, value);
		break;
	case PORTF:
			STV3BI(GPIOF->DATA, start_INDEX, value);
		break;
	}
}
void GPIO_Four_INDEXs_Digital_Output(uint8_t port, uint8_t start_INDEX,uint8_t value) {
	switch (port) {
	case PORTA:
			STV4BI(GPIOA->DATA, start_INDEX, value);
		break;
	case PORTB:
			STV4BI(GPIOB->DATA, start_INDEX, value);
		break;
	case PORTC:
			STV4BI(GPIOC->DATA, start_INDEX, value);
		break;
	case PORTD:
			STV4BI(GPIOD->DATA, start_INDEX, value);
		break;
	case PORTE:
			STV4BI(GPIOE->DATA, start_INDEX, value);
		break;
	case PORTF:
			STV4BI(GPIOF->DATA, start_INDEX, value);
		break;
	}
}
uint8_t GPIO_Two_INDEXs_Read_Input(uint8_t port, uint8_t start_INDEX) {
	uint8_t input = 0;
	switch (port) {
	case PORTA:
			input = RD2B(GPIOA->DATA, start_INDEX);
		break;
	case PORTB:
			input = RD2B(GPIOB->DATA, start_INDEX);
		break;
	case PORTC:
			input = RD2B(GPIOC->DATA, start_INDEX);
		break;
	case PORTD:
			input = RD2B(GPIOD->DATA, start_INDEX);
		break;
	case PORTE:
			input = RD2B(GPIOE->DATA, start_INDEX);
		break;
	case PORTF:
			input = RD2B(GPIOF->DATA, start_INDEX);
		break;
	}
	return input;
}
uint8_t GPIO_Three_INDEXs_DIGITAL_INPUT_INERNAL_PULLUP_READ(uint8_t port, uint8_t start_INDEX) {
	uint8_t input = 0;
	switch (port) {
	case PORTA:
			input = RD3B(GPIOA->DATA, start_INDEX);
		break;
	case PORTB:
			input = RD3B(GPIOB->DATA, start_INDEX);
		break;
	case PORTC:
			input = RD3B(GPIOC->DATA, start_INDEX);
		break;
	case PORTD:
			input = RD3B(GPIOD->DATA, start_INDEX);
		break;
	case PORTE:
			input = RD3B(GPIOE->DATA, start_INDEX);
		break;
	case PORTF:
			input = RD3B(GPIOF->DATA, start_INDEX);
		break;
	}
	return input;
}
uint8_t GPIO_Four_INDEXs_DIGITAL_INPUT_INERNAL_PULLUP_READ(uint8_t port, uint8_t start_INDEX) {
	uint8_t input = 0;
	switch (port) {
	case PORTA:
			input = RD4B(GPIOA->DATA, start_INDEX);
		break;
	case PORTB:
			input = RD4B(GPIOB->DATA, start_INDEX);
		break;
	case PORTC:
			input = RD4B(GPIOC->DATA, start_INDEX);
		break;
	case PORTD:
			input = RD4B(GPIOD->DATA, start_INDEX);
		break;
	case PORTE:
			input = RD4B(GPIOE->DATA, start_INDEX);
		break;
	case PORTF:
			input = RD4B(GPIOF->DATA, start_INDEX);
		break;
	}
	return input;
}
